# Merging Dataframes with Pandas

In [1]:
# Import pandas
import pandas as pd

### 10.1 Reading multiple csv files in sequence

In [2]:
# Read 'Bronze.csv' into a DataFrame: bronze
bronze = pd.read_csv('Bronze.csv')

# Read 'Silver.csv' into a DataFrame: silver
silver = pd.read_csv('Silver.csv')

# Read 'Gold.csv' into a DataFrame: gold
gold = pd.read_csv('Gold.csv')

# Print the first five rows of gold
print(gold.head())

   NOC         Country   Total
0  USA   United States  2088.0
1  URS    Soviet Union   838.0
2  GBR  United Kingdom   498.0
3  FRA          France   378.0
4  GER         Germany   407.0

### 10.2 Reading multiple csv files in a list

In [2]:
# Create the list of file names: filenames
filenames = ['Gold.csv', 'Silver.csv', 'Bronze.csv']

# Create the list of three DataFrames: dataframes
dataframes = []
for filename in filenames:
    dataframes.append(pd.read_csv(filename))

# Print top 5 rows of 1st DataFrame in dataframes
print(dataframes[0].head())

   NOC         Country   Total
0  USA   United States  2088.0
1  URS    Soviet Union   838.0
2  GBR  United Kingdom   498.0
3  FRA          France   378.0
4  GER         Germany   407.0

In [3]:
dataframes
# output shows three data frames

[     NOC               Country   Total
 0    USA         United States  2088.0
 1    URS          Soviet Union   838.0
 2    GBR        United Kingdom   498.0
 3    FRA                France   378.0
 4    GER               Germany   407.0
 ..   ...                   ...     ...
 133  SEN               Senegal     NaN
 134  SUD                 Sudan     NaN
 135  TGA                 Tonga     NaN
 136  BDI               Burundi     1.0
 137  UAE  United Arab Emirates     1.0

 [138 rows x 3 columns],      NOC               Country   Total
 0    USA         United States  1195.0
 1    URS          Soviet Union   627.0
 2    GBR        United Kingdom   591.0
 3    FRA                France   461.0
 4    GER               Germany   350.0
 ..   ...                   ...     ...
 133  SEN               Senegal     1.0
 134  SUD                 Sudan     1.0
 135  TGA                 Tonga     1.0
 136  BDI               Burundi     NaN
 137  UAE  United Arab Emirates     NaN

 [138 rows x 3 columns],      NOC               Country   Total
 0    USA         United States  1052.0
 1    URS          Soviet Union   584.0
 2    GBR        United Kingdom   505.0
 3    FRA                France   475.0
 4    GER               Germany   454.0
 ..   ...                   ...     ...
 133  SEN               Senegal     NaN
 134  SUD                 Sudan     NaN
 135  TGA                 Tonga     NaN
 136  BDI               Burundi     NaN
 137  UAE  United Arab Emirates     NaN

 [138 rows x 3 columns]]

### 10.3 Brute Force Dataframe Merging

In [7]:
# Make a copy of gold: medals
# Read 'Gold.csv' into a DataFrame: gold
gold = pd.read_csv('Gold.csv')
# Read 'Bronze.csv' into a DataFrame: bronze
bronze = pd.read_csv('Bronze.csv')

# Read 'Silver.csv' into a DataFrame: silver
silver = pd.read_csv('Silver.csv')
medals = gold.copy()

# Create list of new column labels: new_labels
new_labels = ['NOC', 'Country', 'Gold']

# Rename the columns of medals using new_labels
medals.columns = new_labels

# Add columns 'Silver' & 'Bronze' to medals
medals['Silver'] = silver['Total']
medals['Bronze'] = bronze['Total']

# Print the head of medals
print(medals.head())

   NOC         Country    Gold  Silver  Bronze
0  USA   United States  2088.0  1195.0  1052.0
1  URS    Soviet Union   838.0   627.0   584.0
2  GBR  United Kingdom   498.0   591.0   505.0
3  FRA          France   378.0   461.0   475.0
4  GER         Germany   407.0   350.0   454.0

### 10.4 Reindexing Dataframes by Sorting Indexes

In [10]:
# Read 'monthly_max_temp.csv' into a DataFrame: weather1
weather1 = pd.read_csv('monthly_max_temp.csv', index_col='Month')

# Print the head of weather1
print(weather1.head())

       Max TemperatureF
Month
Apr                60.2
Jan                32.5
Jul                98.8
Oct                78.2

In [11]:
# Sort the index of weather1 in alphabetical order: weather2
weather2 = weather1.sort_index(ascending=True)

# Print the head of weather2
print(weather2.head())

       Max TemperatureF
Month
Apr                60.2
Jan                32.5
Jul                98.8
Oct                78.2

In [12]:
# Sort the index of weather1 in reverse alphabetical order: weather3
weather3 = weather1.sort_index(ascending=False)

# Print the head of weather3
print(weather3.head())

       Max TemperatureF
Month
Oct                78.2
Jul                98.8
Jan                32.5
Apr                60.2

In [13]:
# Sort weather1 numerically using the values of 'Max TemperatureF': weather4
weather4 = weather1.sort_values('Max TemperatureF')

# Print the head of weather4
print(weather4.head())

       Max TemperatureF
Month
Jan                32.5
Apr                60.2
Oct                78.2
Jul                98.8

### 10.5 Reindexing Dataframes by RE-INDEXING (vs Sorting from 10.4)

In [16]:
year = ['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'Jul', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec']

In [22]:
# Read 'monthly_max_temp.csv' into a DataFrame: weather1
weather1 = pd.read_csv('monthly_mean_temp.csv', index_col='Month')

In [23]:
# Reindex weather1 using the list year: weather2
weather2 = weather1.reindex(year)
weather2

       Mean TemperatureF
Month
Jan                 33.1
Feb                  NaN
Mar                  NaN
Apr                 65.2
May                  NaN
Jun                  NaN
Jul                 94.6
Aug                  NaN
Sep                  NaN
Oct                 74.5
Nov                  NaN
Dec                  NaN

In [27]:
# Reindex weather1 using the list year with forward-fill: weather3
weather3 = weather1.reindex(year).ffill()
weather3

       Mean TemperatureF
Month
Jan                 33.1
Feb                 33.1
Mar                 33.1
Apr                 65.2
May                 65.2
Jun                 65.2
Jul                 94.6
Aug                 94.6
Sep                 94.6
Oct                 74.5
Nov                 74.5
Dec                 74.5

### 10.6 Reindexing Dataframes with the index of another Dataframe

In [29]:
names_1981 = pd.read_csv('names1981.csv', header=None, names=['name','gender','count'], index_col=(0,1))
names_1881 = pd.read_csv('names1881.csv', header=None, names=['name','gender','count'], index_col=(0,1))

In [30]:
names_1981.head()

                 count
name     gender
Jennifer F       57032
Jessica  F       42519
Amanda   F       34370
Sarah    F       28162
Melissa  F       28003

In [31]:
names_1881.head()

                  count
name      gender
Mary      F        6919
Anna      F        2698
Emma      F        2034
Elizabeth F        1852
Margaret  F        1658

Your job here is to use the DataFrame .reindex() and .dropna() methods to make a DataFrame common_names counting names from 1881 that were still popular in 1981.

In [32]:
# Reindex names_1981 with index of names_1881: common_names
common_names = names_1981.reindex(names_1881.index)

In [34]:
# Print shape of common_names
print(common_names.shape)

(1587, 1)

In [35]:
# Drop rows with null counts: common_names
common_names = common_names.dropna()

In [36]:
# Print shape of new common_names
print(common_names.shape)

(1587, 1)

### 10.7 Arithmetic with Dataframes

In [45]:
weather = pd.read_csv('pittsburgh2013.csv')
weather.columns

Index(['Date', 'Max TemperatureF', 'Mean TemperatureF', 'Min TemperatureF',
       'Max Dew PointF', 'MeanDew PointF', 'Min DewpointF', 'Max Humidity',
       'Mean Humidity', 'Min Humidity', 'Max Sea Level PressureIn',
       'Mean Sea Level PressureIn', 'Min Sea Level PressureIn',
       'Max VisibilityMiles', 'Mean VisibilityMiles', 'Min VisibilityMiles',
       'Max Wind SpeedMPH', 'Mean Wind SpeedMPH', 'Max Gust SpeedMPH',
       'PrecipitationIn', ' CloudCover', 'Events', 'WindDirDegrees'],
      dtype='object')

In [46]:
weather.head()

,Date,Max TemperatureF,Mean TemperatureF,Min TemperatureF,Max Dew PointF,MeanDew PointF,Min DewpointF,Max Humidity,Mean Humidity,Min Humidity,...,Max VisibilityMiles,Mean VisibilityMiles,Min VisibilityMiles,Max Wind SpeedMPH,Mean Wind SpeedMPH,Max Gust SpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,2013-1-1,32,28,21,30,27,16,100,89,77,...,10,6,2,10,8,NaN,0.00,8,Snow,277
1,2013-1-2,25,21,17,14,12,10,77,67,55,...,10,10,10,14,5,NaN,0.00,4,NaN,272
2,2013-1-3,32,24,16,19,15,9,77,67,56,...,10,10,10,17,8,26.0,0.00,3,NaN,229
3,2013-1-4,30,28,27,21,19,17,75,68,59,...,10,10,6,23,16,32.0,0.00,4,NaN,250
4,2013-1-5,34,30,25,23,20,16,75,68,61,...,10,10,10,16,10,23.0,0.21,5,NaN,221

In [47]:
# Extract selected columns from weather as new DataFrame: temps_f
temps_f = weather[['Min TemperatureF','Mean TemperatureF','Max TemperatureF']]

In [48]:
temps_f

     Min TemperatureF  Mean TemperatureF  Max TemperatureF
0                  21                 28                32
1                  17                 21                25
2                  16                 24                32
3                  27                 28                30
4                  25                 30                34
..                ...                ...               ...
360                27                 34                41
361                34                 43                52
362                39                 42                44
363                23                 32                41
364                23                 24                26

[365 rows x 3 columns]

In [49]:
# Convert temps_f to celsius: temps_c
temps_c = (temps_f - 32) * 5/9 # this formula is applied to all values in the farenheit dataframe
temps_c

     Min TemperatureF  Mean TemperatureF  Max TemperatureF
0           -6.111111          -2.222222          0.000000
1           -8.333333          -6.111111         -3.888889
2           -8.888889          -4.444444          0.000000
3           -2.777778          -2.222222         -1.111111
4           -3.888889          -1.111111          1.111111
..                ...                ...               ...
360         -2.777778           1.111111          5.000000
361          1.111111           6.111111         11.111111
362          3.888889           5.555556          6.666667
363         -5.000000           0.000000          5.000000
364         -5.000000          -4.444444         -3.333333

[365 rows x 3 columns]

In [50]:
# Rename 'F' in column names with 'C': temps_c.columns
temps_c.columns = temps_c.columns.str.replace('F', 'C')
temps_c

     Min TemperatureC  Mean TemperatureC  Max TemperatureC
0           -6.111111          -2.222222          0.000000
1           -8.333333          -6.111111         -3.888889
2           -8.888889          -4.444444          0.000000
3           -2.777778          -2.222222         -1.111111
4           -3.888889          -1.111111          1.111111
..                ...                ...               ...
360         -2.777778           1.111111          5.000000
361          1.111111           6.111111         11.111111
362          3.888889           5.555556          6.666667
363         -5.000000           0.000000          5.000000
364         -5.000000          -4.444444         -3.333333

[365 rows x 3 columns]

### 10.8 Percentage Growth with Dataframes

In [52]:
# Read 'GDP.csv' into a DataFrame: gdp
gdp = pd.read_csv('gdp_usa.csv', parse_dates=True, index_col='DATE')

In [53]:
gdp

              VALUE
DATE
1947-01-01    243.1
1947-04-01    246.3
1947-07-01    250.1
1947-10-01    260.3
1948-01-01    266.2
...             ...
2015-04-01  17998.3
2015-07-01  18141.9
2015-10-01  18222.8
2016-01-01  18281.6
2016-04-01  18436.5

[278 rows x 1 columns]

In [54]:
# Slice all the gdp data from 2008 onward: post2008
post2008 = gdp['2008':]

# Print the last 8 rows of post2008
print(post2008.tail(8))

              VALUE
DATE
2014-07-01  17569.4
2014-10-01  17692.2
2015-01-01  17783.6
2015-04-01  17998.3
2015-07-01  18141.9
2015-10-01  18222.8
2016-01-01  18281.6
2016-04-01  18436.5

In [55]:
# Resample post2008 by year, keeping last(): yearly
yearly = post2008.resample('A').last()

# Print yearly
print(yearly)

              VALUE
DATE
2008-12-31  14549.9
2009-12-31  14566.5
2010-12-31  15230.2
2011-12-31  15785.3
2012-12-31  16297.3
2013-12-31  16999.9
2014-12-31  17692.2
2015-12-31  18222.8
2016-12-31  18436.5

In [57]:
# Compute percentage growth of yearly: yearly['growth']
yearly['growth'] = yearly.pct_change()*100

# Print yearly again
print(yearly)

              VALUE    growth
DATE
2008-12-31  14549.9       NaN
2009-12-31  14566.5  0.114090
2010-12-31  15230.2  4.556345
2011-12-31  15785.3  3.644732
2012-12-31  16297.3  3.243524
2013-12-31  16999.9  4.311144
2014-12-31  17692.2  4.072377
2015-12-31  18222.8  2.999062
2016-12-31  18436.5  1.172707

### 10.9 Converting Stock Currencies

In [59]:
sp500 = pd.read_csv('sp500.csv', parse_dates=True, index_col='Date')
exchange = pd.read_csv('exchange.csv', parse_dates=True, index_col='Date')

In [60]:
sp500.head()

,Open,High,Low,Close,Volume,Adj Close
Date,,,,,,
2015-01-02,2058.899902,2072.360107,2046.040039,2058.199951,2708700000,2058.199951
2015-01-05,2054.439941,2054.439941,2017.339966,2020.579956,3799120000,2020.579956
2015-01-06,2022.150024,2030.250000,1992.439941,2002.609985,4460110000,2002.609985
2015-01-07,2005.550049,2029.609985,2005.550049,2025.900024,3805480000,2025.900024
2015-01-08,2030.609985,2064.080078,2030.609985,2062.139893,3934010000,2062.139893

In [61]:
exchange.head()

            GBP/USD
Date
2015-01-02  0.65101
2015-01-05  0.65644
2015-01-06  0.65896
2015-01-07  0.66344
2015-01-08  0.66151

In [64]:
# Subset 'Open' & 'Close' columns from sp500: dollars
dollars = sp500[['Open','Close']]
# Print the head of dollars
print(dollars.head())

                   Open        Close
Date
2015-01-02  2058.899902  2058.199951
2015-01-05  2054.439941  2020.579956
2015-01-06  2022.150024  2002.609985
2015-01-07  2005.550049  2025.900024
2015-01-08  2030.609985  2062.139893

In [65]:
# Convert dollars to pounds: pounds
pounds = dollars.multiply(exchange['GBP/USD'], axis='rows')

# Print the head of pounds
print(pounds.head())

                   Open        Close
Date
2015-01-02  1340.364425  1339.908750
2015-01-05  1348.616555  1326.389506
2015-01-06  1332.515980  1319.639876
2015-01-07  1330.562125  1344.063112
2015-01-08  1343.268811  1364.126161